NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/access/src/access.c
    bool loopback_packet = is_access_loopback(&dst_address);
    if (loopback_packet)
    {
        access_loopback_request_t request =
        {
            .token = p_tx_message->access_token,
            .opcode = p_tx_message->opcode, /*lint !e64 Type mismatch */
            .p_data = p_tx_message->p_buffer,
            .length = p_tx_message->length,
            .src_value = src_address,
            .dst = dst_address,              /*lint !e64 Type mismatch */
            .ttl = ttl,
            .appkey_handle = appkey_handle,
            .subnet_handle = subnet_handle
        };

        status = access_loopback_handle(&request);
    }

    if (!loopback_packet || (dst_address.type != NRF_MESH_ADDRESS_TYPE_UNICAST))
    {
        NRF_MESH_ASSERT_DEBUG(p_access_payload != NULL);
        NRF_MESH_ASSERT_DEBUG(access_payload_len != 0);

        nrf_mesh_tx_params_t tx_params;
        memset(&tx_params, 0, sizeof(tx_params));

#if MESH_FEATURE_LPN_ENABLED
        status = NRF_ERROR_NOT_FOUND;
        if (m_model_pool[handle].model_info.friendship_credential_flag)
        {
            status = dsm_tx_friendship_secmat_get(subnet_handle, appkey_handle, &tx_params.security_material);
        }

        /* The Mesh Profile Specification v1.0, Section 4.2.2.4:
         *
         * When Publish Friendship Credential Flag is set to 1 and the friendship security material is
         * not available, the master security material shall be used. */
        if (NRF_ERROR_NOT_FOUND == status)
#endif
        {
            status = dsm_tx_secmat_get(subnet_handle, appkey_handle, &tx_params.security_material);
        }

        if (status != NRF_SUCCESS)
        {
            return status;
        }

        tx_params.dst = dst_address;
        tx_params.src = src_address;
        tx_params.ttl = ttl;
        tx_params.force_segmented = p_tx_message->force_segmented;
        tx_params.transmic_size = p_tx_message->transmic_size;
        tx_params.p_data = p_access_payload;
        tx_params.data_len = access_payload_len;
        tx_params.tx_token = p_tx_message->access_token;

        status = nrf_mesh_packet_send(&tx_params, NULL);
        if (status == NRF_SUCCESS)
        {
            __LOG(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "TX: [aop: 0x%04x] \n", p_tx_message->opcode.opcode);
            __LOG_XB(LOG_SRC_ACCESS, LOG_LEVEL_DBG1, "TX: Msg", p_tx_message->p_buffer, p_tx_message->length);
        }
    }

    return status;
}

static uint32_t packet_alloc_and_tx(access_model_handle_t handle,
                                    const access_message_tx_t * p_tx_message,
                                    const access_message_rx_t * p_rx_message,
                                    uint8_t **pp_access_payload,
                                    uint16_t *p_access_payload_len)
{
    NRF_MESH_ASSERT_DEBUG(p_tx_message != NULL);

    uint32_t status;

    if (!check_tx_params(handle, p_tx_message, p_rx_message, &status))
    {
        return status;
    }

    uint16_t opcode_length = access_utils_opcode_size_get(p_tx_message->opcode);
    uint16_t payload_length = opcode_length + p_tx_message->length;

    uint8_t *p_payload = (uint8_t *) mesh_mem_alloc(payload_length);
    if (NULL == p_payload)
    {
        return NRF_ERROR_NO_MEM;
    }

    opcode_set(p_tx_message->opcode, p_payload);
    memcpy(&p_payload[opcode_length], p_tx_message->p_buffer, p_tx_message->length);

    status = packet_tx(handle, p_tx_message, p_rx_message, p_payload, payload_length);
    if (NRF_SUCCESS != status || NULL == pp_access_payload || NULL == p_access_payload_len)
    {
        mesh_mem_free(p_payload);
        return status;
    }

    *pp_access_payload = p_payload;
    *p_access_payload_len = payload_length;

    return NRF_SUCCESS;
}

static void access_state_clear(void)
{
    memset(&m_model_pool[0], 0, sizeof(m_model_pool));
    memset(&m_element_pool[0], 0, sizeof(m_element_pool));
    memset(&m_subscription_list_pool[0], 0, sizeof(m_subscription_list_pool));
    for (uint16_t i = 0; i < ARRAY_SIZE(m_model_pool); ++i)
    {
        m_model_pool[i].model_info.publish_address_handle = DSM_HANDLE_INVALID;
        m_model_pool[i].model_info.publish_appkey_handle = DSM_HANDLE_INVALID;
        m_model_pool[i].model_info.subscription_pool_index = ACCESS_SUBSCRIPTION_LIST_COUNT;
        m_model_pool[i].model_info.element_index = ACCESS_ELEMENT_INDEX_INVALID;
    }
}

static bool model_subscribes_to_addr(const access_common_t * p_model, dsm_handle_t address_handle)
{
    return (p_model->model_info.subscription_pool_index < ACCESS_SUBSCRIPTION_LIST_COUNT &&
            bitfield_get(m_subscription_list_pool[p_model->model_info.subscription_pool_index].bitfield,
                         address_handle));
}

/**
 * Checks whether a destination address is designated for a specific element.
 *
 * @param[in] p_dst The destination address to check for
 * @param[in,out] p_index Index of the element that should process the message destined for the given address.
 *
 * @returns Whether or not the destination address is designated for a specific element.
 */
static bool is_element_rx_address(const nrf_mesh_address_t * p_dst, uint16_t * p_index)
{
    if (p_dst->type == NRF_MESH_ADDRESS_TYPE_UNICAST)
    {
        dsm_local_unicast_address_t local_addresses;
        dsm_local_unicast_addresses_get(&local_addresses);

        *p_index = p_dst->value - local_addresses.address_start;
        return true;
    }
    else if (p_dst->value == NRF_MESH_ALL_PROXIES_ADDR ||
             p_dst->value == NRF_MESH_ALL_FRIENDS_ADDR ||
             p_dst->value == NRF_MESH_ALL_RELAYS_ADDR ||
             p_dst->value == NRF_MESH_ALL_NODES_ADDR)
    {
        /* According to the Mesh Profile Specification v1.0 section 3.4.2, only models on the
         * primary element of the node shall process the fixed group addresses. */
        *p_index = 0;
        return true;
    }
    return false;
}

/* Checks if the model's subscription list is shared. Note: Model handle must be valid */
static bool model_subscription_list_is_shared(access_model_handle_t handle)
{
    NRF_MESH_ASSERT_DEBUG(model_handle_valid_and_allocated(handle));
    uint16_t sub_pool_index = m_model_pool[handle].model_info.subscription_pool_index;

    for (uint32_t i = 0; i < ACCESS_MODEL_COUNT; ++i)
    {
        if (m_model_pool[i].model_info.subscription_pool_index == sub_pool_index && i != handle)
        {
            return true;
        }
    }

